let regExps = {
    qq:  /^[1-9]\d{4,14}$/ , // QQ
    email:  /^[a-zA-Z0-9_-]+@[a-zA-Z0-9_-]+(\.[a-zA-Z0-9_-]+)+$/,  // 邮编
    cardId: /(^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$)|(^[1-9]\d{5}\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{2}$)/, // 15位或18位身份证号
    url: /^http:\/\/[A-Za-z0-9]+\.[A-Za-z0-9]+[\/=\?%\-&_~`@[\]\':+!]*([^<>\"\"])*$/,
    telephone:  /^((\(\d{2,3}\))|(\d{3}\-))?(\(0\d{2,3}\)|0\d{2,3}-)?[1-9]\d{6,7}(\-\d{1,4})?$/, // 电话号码，格式为：XXXX-XXXXXXX，XXXX-XXXXXXXX，XXX-XXXXXXX，XXX-XXXXXXXX，XXXXXXX，XXXXXXXX。 
    cellphone:  /^0?(13[0-9]|15[012356789]|18[0236789]|14[57])[0-9]{8}$/,  // 手机
    zip: /^[1-9][0-9]{5}$/, // 邮编
    ip: /^(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])(\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])){3}$/, // IP地址
    date:  /^\d{4}-(0?[1-9]|1[0-2])-(0?[1-9]|[1-2]\d|3[0-1])$/, // 日期
    time: /^([0-1]\d|2[0-3]):[0-5]\d:[0-5]\d$/, // 时间
    dateTime: /^\d{4}-(0?[1-9]|1[0-2])-(0?[1-9]|[1-2]\d|3[0-1])\s{1,2}([0-1]\d|2[0-3]):[0-5]\d:[0-5]\d$/, // 日期和时间，中间1~2个空格
    year: /^\d{4}$/, // 年份
    month: /^(0?[1-9]|1[0-2])$/  , // 月份,正确格式为：“01”-“09”和“1”“12”
    day: /^((0?[1-9])|((1|2)[0-9])|30|31)$/,  //天数，正确格式为：01、09和1、31
    integer: /^[-+]?\d*$/ , // 整数
    double: /^[-\+]?\d+(\.\d+)?$/, // 小数
    chinese: /^[\u0391-\uFFE5]+$/, // 中文
    password: /^[a-zA-Z]\w{5,17}$/, // 以字母开头，长度在6~18之间，只能包含字母、数字和下划线
    money: /^[0-9]{1,3}(,[0-9]{3})*(.[0-9]{1,2})?$/, // 1,000,000
    number1: /^\d{m,n}$/ ,  // m-n位的数字
    number2: /^(0|[1-9][0-9]*)$/ , // 零和非零开头的数字
    number3: /^([1-9][0-9]*)+(.[0-9]{1,2})?$/ , // 非零开头的最多带两位小数的数字
    number4: /^(\-)?\d+(\.\d{1,2})?$/ , // 带1-2位小数的正数或负数
    number5: /^\+?[1-9][0-9]*$/ , // 非零的正整数
    number6: /^[1-9]\d*|0$/ , // 非负整数
    number7: /^-?([1-9]\d*\.\d*|0\.\d*[1-9]\d*|0?\.0+|0)$/ , // 浮点数
}
function enCode(value){
    return encodeURI(encodeURI(value))
}
function deCode(value){
    return decodeURI(decodeURI(value))
}